---
kind: property
id: P:Autodesk.Revit.DB.Events.DocumentReloadLatestProgressChangedEventArgs.RetryTimes
source: html/c153b093-e3da-f8d5-2068-64619c9076c8.htm
---
# Autodesk.Revit.DB.Events.DocumentReloadLatestProgressChangedEventArgs.RetryTimes Property

The number of times Revit has tried to Reload Latest. Its value is '0' at the first time.

## Syntax (C#)
```csharp
public int RetryTimes { get; }
```